In [3]:
#Import Dependencies 
from path import Path
import pandas as pd
import numpy as np

# degrees_df

In [4]:
# read in csv as a df
degrees_df = pd.read_csv('Resources/clean_degrees_by_state.csv')
degrees_df.head()

        State  Year    #_BAs
0     Alabama  2005   288815
1      Alaska  2005    45315
2     Arizona  2005   408520
3    Arkansas  2005   152225
4  California  2005  3112605

In [5]:
# Change column headings to upper case and convert STATE column values to upper case
degrees_df = degrees_df.rename(columns=str.upper)
degrees_df['STATE'] = degrees_df['STATE'].str.upper()

In [6]:
degrees_2000 = degrees_df[(degrees_df.YEAR ==2005)]
degrees_2004 = degrees_df[(degrees_df.YEAR ==2005)]
degrees_2020 = degrees_df[(degrees_df.YEAR ==2019)]
degrees_2000.loc[degrees_2000['YEAR'] == 2005, 'YEAR'] = 2000
degrees_2004.loc[degrees_2004['YEAR'] == 2005, 'YEAR'] = 2004
degrees_2020.loc[degrees_2020['YEAR'] == 2019, 'YEAR'] = 2020

C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)
C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)
C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [7]:
degrees_df = degrees_df.append(degrees_2000,ignore_index=True)
degrees_df = degrees_df.append(degrees_2004,ignore_index=True)
degrees_df = degrees_df.append(degrees_2020,ignore_index=True)

In [8]:
# Filter df to include only presidential election year data. 
degrees_df = degrees_df[degrees_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR']).rename(columns = {'#_BAS': 'BACHELORS_DEGREE_TOT'}, inplace = False)
degrees_df

             STATE  YEAR  BACHELORS_DEGREE_TOT
815        WYOMING  2000                 29830
786  MASSACHUSETTS  2000                780520
785       MARYLAND  2000                582280
784          MAINE  2000                 85985
783      LOUISIANA  2000                267430
..             ...   ...                   ...
887       MARYLAND  2020                712675
888  MASSACHUSETTS  2020                974100
889       MICHIGAN  2020                851380
891    MISSISSIPPI  2020                172285
917        WYOMING  2020                 44925

[306 rows x 3 columns]

# incarceration_df

In [9]:
# read in csv as a df
incarceration_df = pd.read_csv('Resources/clean_incarceration.csv')
incarceration_df.head()

   Year    State Prison_Jail_Rate  value
0  2000  Alabama        Jail Rate  203.1
1  2000  Alabama      Prison Rate  584.8
2  2000   Alaska      Prison Rate  339.1
3  2000  Arizona        Jail Rate  196.9
4  2000  Arizona      Prison Rate  491.8

In [10]:
# Change column headings to upper case and convert STATE column values to upper case
incarceration_df = incarceration_df.rename(columns=str.upper)
incarceration_df['STATE'] = incarceration_df['STATE'].str.upper()
incarceration_df

      YEAR          STATE PRISON_JAIL_RATE  VALUE
0     2000        ALABAMA        Jail Rate  203.1
1     2000        ALABAMA      Prison Rate  584.8
2     2000         ALASKA      Prison Rate  339.1
3     2000        ARIZONA        Jail Rate  196.9
4     2000        ARIZONA      Prison Rate  491.8
...    ...            ...              ...    ...
1441  2015       VIRGINIA      Prison Rate  456.7
1442  2015     WASHINGTON      Prison Rate  252.2
1443  2015  WEST VIRGINIA      Prison Rate  386.0
1444  2015      WISCONSIN      Prison Rate  376.6
1445  2015        WYOMING      Prison Rate  413.1

[1446 rows x 4 columns]

In [11]:
#Split prison and jail rates into separate columns and 
jail_df = incarceration_df[(incarceration_df.PRISON_JAIL_RATE == 'Jail Rate')].rename(columns = {'VALUE': 'JAIL_RATE'}, inplace = False).drop(columns=['PRISON_JAIL_RATE'])
prison_df = incarceration_df[(incarceration_df.PRISON_JAIL_RATE == 'Prison Rate')].rename(columns = {'VALUE': 'PRISON_RATE'}, inplace = False).drop(columns=['PRISON_JAIL_RATE'])
incarceration_df = pd.merge(jail_df, prison_df, how='right', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])
incarceration_df

     YEAR          STATE  JAIL_RATE  PRISON_RATE
0    2000        ALABAMA      203.1        584.8
1    2000         ALASKA        NaN        339.1
2    2000        ARIZONA      196.9        491.8
3    2000       ARKANSAS      163.1        442.5
4    2000     CALIFORNIA      193.1        471.9
..    ...            ...        ...          ...
811  2015       VIRGINIA        NaN        456.7
812  2015     WASHINGTON        NaN        252.2
813  2015  WEST VIRGINIA        NaN        386.0
814  2015      WISCONSIN        NaN        376.6
815  2015        WYOMING        NaN        413.1

[816 rows x 4 columns]

In [12]:
# Duplicate 2015 values for 2016/2020 and append to df
incarceration_2016 = incarceration_df[(incarceration_df.YEAR ==2015)]
incarceration_2020 = incarceration_df[(incarceration_df.YEAR ==2015)]

incarceration_2016.loc[incarceration_2016['YEAR'] == 2015, 'YEAR'] = 2016
incarceration_2020.loc[incarceration_2020['YEAR'] == 2015, 'YEAR'] = 2020

incarceration_df = incarceration_df.append(incarceration_2016,ignore_index=True)
incarceration_df = incarceration_df.append(incarceration_2020,ignore_index=True)
incarceration_df

C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)
C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

     YEAR          STATE  JAIL_RATE  PRISON_RATE
0    2000        ALABAMA      203.1        584.8
1    2000         ALASKA        NaN        339.1
2    2000        ARIZONA      196.9        491.8
3    2000       ARKANSAS      163.1        442.5
4    2000     CALIFORNIA      193.1        471.9
..    ...            ...        ...          ...
913  2020       VIRGINIA        NaN        456.7
914  2020     WASHINGTON        NaN        252.2
915  2020  WEST VIRGINIA        NaN        386.0
916  2020      WISCONSIN        NaN        376.6
917  2020        WYOMING        NaN        413.1

[918 rows x 4 columns]

In [13]:
# Filter df to include only presidential election year data. 
incarceration_df = incarceration_df[incarceration_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR'])
incarceration_df

     YEAR          STATE  JAIL_RATE  PRISON_RATE
0    2000        ALABAMA      203.1        584.8
28   2000         NEVADA      219.7        498.6
29   2000  NEW HAMPSHIRE       47.3        182.0
30   2000     NEW JERSEY      128.8        353.3
31   2000     NEW MEXICO      275.4        256.3
..    ...            ...        ...          ...
887  2020       MARYLAND        NaN        338.8
888  2020  MASSACHUSETTS        NaN        179.3
889  2020       MICHIGAN        NaN        429.2
891  2020    MISSISSIPPI        NaN        608.8
917  2020        WYOMING        NaN        413.1

[306 rows x 4 columns]

# income_df

In [14]:
# read in csv as a df
income_df = pd.read_csv('Resources/clean_med_income.csv')
income_df.head()

     Year       State  Med_House_Inc
0  1984.0     Alabama          17310
1  1984.0      Alaska          18333
2  1984.0     Arizona          19132
3  1984.0    Arkansas          19734
4  1984.0  California          19948

In [15]:
# Change column headings to upper case and convert STATE column values to upper case
income_df = income_df.rename(columns=str.upper)
income_df['STATE'] = income_df['STATE'].str.upper()

In [16]:
# Convert YEAR to int 
income_df['YEAR'] = income_df['YEAR'].astype(int)
income_df

      YEAR          STATE  MED_HOUSE_INC
0     1984        ALABAMA          17310
1     1984         ALASKA          18333
2     1984        ARIZONA          19132
3     1984       ARKANSAS          19734
4     1984     CALIFORNIA          19948
...    ...            ...            ...
1933  2019       VIRGINIA          57829
1934  2019     WASHINGTON          59536
1935  2019  WEST VIRGINIA          57837
1936  2019      WISCONSIN          62539
1937  2019        WYOMING          65134

[1938 rows x 3 columns]

In [17]:
# Change 2019 to 2020 so that it can be joined with 2020 election data. 
income_df.loc[income_df['YEAR'] == 2019, 'YEAR'] = 2020

# Filter df to include only presidential election year data. 
income_df = income_df[income_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR'])
income_df

      YEAR          STATE  MED_HOUSE_INC
816   2000        ALABAMA          49855
844   2000         NEVADA          32267
845   2000  NEW HAMPSHIRE          32662
846   2000     NEW JERSEY          35284
847   2000     NEW MEXICO          36426
...    ...            ...            ...
1907  2020       MARYLAND          29050
1908  2020  MASSACHUSETTS          30209
1909  2020       MICHIGAN          29442
1911  2020    MISSISSIPPI          31529
1937  2020        WYOMING          65134

[306 rows x 3 columns]

# crimes_df

In [18]:
# read in csv as a df
crimes_df = pd.read_csv('Resources/clean_violent_crimes.csv')
crimes_df.head()

   Year       State  violent_crime_rate
0  2000     Alabama               21620
1  2000      Alaska                3554
2  2000     Arizona               27281
3  2000    Arkansas               11904
4  2000  California              210531

In [19]:
# Change column headings to upper case and convert STATE column values to upper case
crimes_df = crimes_df.rename(columns=str.upper)
crimes_df['STATE'] = crimes_df['STATE'].str.upper()

In [20]:
# Change 2019 to 2020 so that it can be joined with 2020 election data. 
crimes_df.loc[crimes_df['YEAR'] == 2019, 'YEAR'] = 2020

# Filter df to include only presidential election year data. 
crimes_df = crimes_df[crimes_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR'])
crimes_df

      YEAR          STATE  VIOLENT_CRIME_RATE
0     2000        ALABAMA               21620
28    2000         NEVADA               10474
29    2000  NEW HAMPSHIRE                2167
30    2000     NEW JERSEY               32298
31    2000     NEW MEXICO               13786
...    ...            ...                 ...
989   2020       MARYLAND               27456
990   2020  MASSACHUSETTS               22578
991   2020       MICHIGAN               43686
993   2020    MISSISSIPPI                8272
1019  2020        WYOMING                1258

[306 rows x 3 columns]

# guns_df (no DC data)

In [21]:
# read in csv as a df
guns_df = pd.read_csv('Resources/guns_per_household.csv')
guns_df.head()

   Year       State  guns_per_household
0  2000     Alabama               0.538
1  2000      Alaska               0.601
2  2000     Arizona               0.427
3  2000    Arkansas               0.542
4  2000  California               0.274

In [22]:
# Change column headings to upper case and convert STATE column values to upper case
guns_df = guns_df.rename(columns=str.upper)
guns_df['STATE'] = guns_df['STATE'].str.upper()
guns_df

     YEAR          STATE  GUNS_PER_HOUSEHOLD
0    2000        ALABAMA               0.538
1    2000         ALASKA               0.601
2    2000        ARIZONA               0.427
3    2000       ARKANSAS               0.542
4    2000     CALIFORNIA               0.274
..    ...            ...                 ...
845  2016       VIRGINIA               0.353
846  2016     WASHINGTON               0.321
847  2016  WEST VIRGINIA               0.600
848  2016      WISCONSIN               0.471
849  2016        WYOMING               0.607

[850 rows x 3 columns]

In [23]:
# Duplicate 2015 values for 2016/2020 and append to df
guns_2020 = guns_df[(guns_df.YEAR ==2016)]

guns_2020.loc[guns_2020['YEAR'] == 2016, 'YEAR'] = 2020

guns_df = guns_df.append(guns_2020,ignore_index=True)

C:\Users\jipea\anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [24]:
# Filter df to include only presidential election year data. 
guns_df = guns_df[guns_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR'])
guns_df

     YEAR          STATE  GUNS_PER_HOUSEHOLD
0    2000        ALABAMA               0.538
27   2000         NEVADA               0.471
28   2000  NEW HAMPSHIRE               0.391
29   2000     NEW JERSEY               0.108
30   2000     NEW MEXICO               0.438
..    ...            ...                 ...
869  2020       MARYLAND               0.167
870  2020  MASSACHUSETTS               0.090
871  2020       MICHIGAN               0.389
860  2020         HAWAII               0.091
899  2020        WYOMING               0.607

[300 rows x 3 columns]

# gdp_df

In [25]:
# read in csv as a df
gdp_df = pd.read_csv('Resources/State_GDP_97_2020.csv',encoding='latin1')
gdp_df.head()

   Year  State  GDP_Millions
0  1997  Texas      610141.2
1  1998  Texas      645289.5
2  1999  Texas      680181.9
3  2000  Texas      738804.4
4  2001  Texas      772909.2

In [26]:
# Change column headings to upper case and convert STATE column values to upper case
gdp_df = gdp_df.rename(columns=str.upper)
gdp_df['STATE'] = gdp_df['STATE'].str.upper()

# Convert YEAR to int 
gdp_df['YEAR'] = gdp_df['YEAR'].astype(int)
gdp_df

      YEAR         STATE  GDP_MILLIONS
0     1997         TEXAS      610141.2
1     1998         TEXAS      645289.5
2     1999         TEXAS      680181.9
3     2000         TEXAS      738804.4
4     2001         TEXAS      772909.2
...    ...           ...           ...
1219  2016  SOUTH DAKOTA       48731.3
1220  2017  SOUTH DAKOTA       50342.9
1221  2018  SOUTH DAKOTA       53239.0
1222  2019  SOUTH DAKOTA       54940.9
1223  2020  SOUTH DAKOTA       54852.1

[1224 rows x 3 columns]

In [27]:
# Filter df to include only presidential election year data. 
gdp_df = gdp_df[gdp_df.YEAR.isin(["2000","2004","2008","2012","2016","2020"])].sort_values(by=['YEAR','STATE'])
gdp_df

     YEAR          STATE  GDP_MILLIONS
195  2000        ALABAMA      120132.9
411  2000         ALASKA       26815.8
267  2000        ARIZONA      164609.9
867  2000       ARKANSAS       68740.4
219  2000     CALIFORNIA     1366166.5
..    ...            ...           ...
935  2020       VIRGINIA      551760.3
119  2020     WASHINGTON      618704.9
647  2020  WEST VIRGINIA       73709.2
695  2020      WISCONSIN      338678.4
719  2020        WYOMING       36241.5

[306 rows x 3 columns]

# urban_df

In [28]:
# read in csv as a df
urban_df = pd.read_csv('Resources/urbanization_rate_80_10.csv')
urban_df.head()

        State  Year  urbanization_rate
0     Alabama  2010              0.590
1      Alaska  2010              0.660
2     Arizona  2010              0.898
3    Arkansas  2010              0.562
4  California  2010              0.950

In [29]:
# Change column headings to upper case and convert STATE column values to upper case
urban_df = urban_df.rename(columns=str.upper)
urban_df['STATE'] = urban_df['STATE'].str.upper()

In [30]:
urban_df

                STATE  YEAR  URBANIZATION_RATE
0             ALABAMA  2010              0.590
1              ALASKA  2010              0.660
2             ARIZONA  2010              0.898
3            ARKANSAS  2010              0.562
4          CALIFORNIA  2010              0.950
..                ...   ...                ...
199        WASHINGTON  1980              0.735
200  WASHINGTON, D.C.  1980              1.000
201     WEST VIRGINIA  1980              0.362
202         WISCONSIN  1980              0.642
203           WYOMING  1980              0.627

[204 rows x 3 columns]

# combine dataframes

In [31]:
combined_df = pd.merge(degrees_df, incarceration_df, how='inner', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])
combined_df = pd.merge(combined_df, income_df, how='inner', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])
combined_df = pd.merge(combined_df, crimes_df, how='inner', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])
combined_df = pd.merge(combined_df, gdp_df, how='inner', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])
combined_df = pd.merge(combined_df, guns_df, how='left', left_on=['YEAR', 'STATE'], right_on = ['YEAR', 'STATE'])



# urban_df - only has decennial data through 2010
# guns_df - no DC data

In [32]:
combined_df.sort_values(by=['YEAR','STATE'])

,STATE,YEAR,BACHELORS_DEGREE_TOT,JAIL_RATE,PRISON_RATE,MED_HOUSE_INC,VIOLENT_CRIME_RATE,GDP_MILLIONS,GUNS_PER_HOUSEHOLD
22,ALABAMA,2000,288815,203.1,584.8,49855,21620,120132.9,0.538
21,ALASKA,2000,45315,NaN,339.1,50955,3554,26815.8,0.601
20,ARIZONA,2000,408520,196.9,491.8,52019,27281,164609.9,0.427
19,ARKANSAS,2000,152225,163.1,442.5,56017,11904,68740.4,0.542
18,CALIFORNIA,2000,3112605,193.1,471.9,55330,210531,1366166.5,0.274
...,...,...,...,...,...,...,...,...,...
273,VIRGINIA,2020,1001990,NaN,456.7,57829,17753,551760.3,0.353
274,WASHINGTON,2020,878310,NaN,252.2,59536,22377,618704.9,0.321
275,WEST VIRGINIA,2020,111125,NaN,386.0,57837,5674,73709.2,0.600
281,WISCONSIN,2020,542485,NaN,376.6,62539,17070,338678.4,0.471
305,WYOMING,2020,44925,NaN,413.1,65134,1258,36241.5,0.607

In [33]:
combined_df.to_csv('Resources/combined_df.csv',index=False)